# COGS 108 - Data Checkpoint

# Names

- Leica Shen
- Yuxuan Wu
- Eddie Ho
- Xuewen Yang

<a id='research_question'></a>
# Research Question

How has the COVID-19 pandemic impact global warming? Specifically, how do changes in greenhouse gas emissions from 2020 to 2022 resulting from pandemic-related lockdowns impact the rate of global temperature increase and sea level rise?

# Dataset(s)

**Dataset 1**
- Dataset Name: global_land_and_ocean_temp_anomalies
- Link to the dataset: https://www.ncei.noaa.gov/access/monitoring/climate-at-a-glance/global/time-series/globe/land_ocean/all/1/1900-2023
- Number of observations: 1480

Global temperature anomalies for land and ocean from 01/1900 to 04/2023, compared to a baseline climatology from 1901-2000.

**Dataset 2**
- Dataset Name: Change_in_Mean_Sea_Levels
- Link to the dataset: https://climatedata.imf.org/datasets/b84a7e25159b4c65ba62d3f82c605855/explore
- Number of observations: 1608

Change in average sea levels across different regions of the world, measured in millimeters and derived from satellite radar altimeter measurements of sea level. The time-series data spans from 12/17/1992 to 8/10/2022, with 3/4 data points available for each month.

**Dataset 3**
- Dataset Name: Atmospheric_CO2_Concentrations
- Link to the dataset: https://climatedata.imf.org/datasets/9c3764c0efcc4c71934ab3988f219e0e/explore
- Number of observations: 1548

Monthly measurements of global atmospheric carbon dioxide ($CO_2$) concentrations are provided as dry air mole fractions in parts per million (ppm), representing the ratio of $CO_2$ molecules to the total number of molecules in the air excluding water vapor. Dataset spans from 3/1958 to 2/2023.

### Combining Datasets

We plan to clean and analyze each dataset first, then we will combine these three datasets into one data frame.

We will first make these three datasets have same time frame from 1992 to 2022 since the shortest time span of our data has its data within 1992-2022. 
Then create a new dataset containing columns of `Year`, `Month`, `CO2_value`, `temp_value`, `sea-level_value`. 

Based on the `Year` and `Month` columns of the cleaned data frames generated by these three datasets, assign the corresponding values to all the other columns in the combined data frame.

# Setup

In [12]:
import pandas as pd
import numpy as np

In [13]:
temp_change = pd.read_csv('data/global_land_and_ocean_temp_anomalies.csv', skiprows=4)
temp_change.head()

     Year  Value
0  190001  -0.30
1  190002  -0.17
2  190003  -0.03
3  190004  -0.05
4  190005  -0.06

In [14]:
temp_change.shape

(1480, 2)

In [15]:
sea_level = pd.read_csv('data/Change_in_Mean_Sea_Levels.csv').drop(columns='ObjectId')
sea_level.head()

,Country,ISO2,ISO3,Indicator,Unit,Source,CTS_Code,CTS_Name,CTS_Full_Descriptor,Measure,Date,Value
0,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Andaman Sea,D12/17/1992,-10.34
1,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Arabian Sea,D12/17/1992,-18.46
2,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Atlantic Ocean,D12/17/1992,-15.41
3,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Baltic Sea,D12/17/1992,196.85
4,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Bay Bengal,D12/17/1992,3.27

In [16]:
sea_level.shape

(35604, 12)

In [17]:
CO2_Concentrations = pd.read_csv('data/Atmospheric_CO2_Concentrations.csv').drop(columns='ObjectId')
CO2_Concentrations.head()

,Country,ISO2,ISO3,Indicator,Unit,Source,CTS_Code,CTS_Name,CTS_Full_Descriptor,Date,Value
0,World,NaN,WLD,Monthly Atmospheric Carbon Dioxide Concentrations,Parts Per Million,"Dr. Pieter Tans, National Oceanic and Atmosphe...",ECCA,Atmospheric Carbon Dioxide Concentrations,"Environment, Climate Change, Climate Indicator...",1958M03,315.70
1,World,NaN,WLD,Monthly Atmospheric Carbon Dioxide Concentrations,Parts Per Million,"Dr. Pieter Tans, National Oceanic and Atmosphe...",ECCA,Atmospheric Carbon Dioxide Concentrations,"Environment, Climate Change, Climate Indicator...",1958M04,317.45
2,World,NaN,WLD,Monthly Atmospheric Carbon Dioxide Concentrations,Parts Per Million,"Dr. Pieter Tans, National Oceanic and Atmosphe...",ECCA,Atmospheric Carbon Dioxide Concentrations,"Environment, Climate Change, Climate Indicator...",1958M05,317.51
3,World,NaN,WLD,Monthly Atmospheric Carbon Dioxide Concentrations,Parts Per Million,"Dr. Pieter Tans, National Oceanic and Atmosphe...",ECCA,Atmospheric Carbon Dioxide Concentrations,"Environment, Climate Change, Climate Indicator...",1958M06,317.24
4,World,NaN,WLD,Monthly Atmospheric Carbon Dioxide Concentrations,Parts Per Million,"Dr. Pieter Tans, National Oceanic and Atmosphe...",ECCA,Atmospheric Carbon Dioxide Concentrations,"Environment, Climate Change, Climate Indicator...",1958M07,315.86

In [18]:
CO2_Concentrations.shape

(1548, 11)

# Data Cleaning

Describe your data cleaning steps here.

### sea_level table

1. Extract `Year` and `Month` of each observation from the `Date` column and convert them into `int` data type. \
    The `Year` and `Month` columns from the above step will be combined with only the `Measure` and `Value` columns from the `sea_level` table. \
    The resulting merged data will be stored in the `sea_level_cleaned` table.

In [19]:
sea_level_cleaned = pd.merge(sea_level[['Measure', 'Value']], sea_level['Date'].str.split('D', expand=True)[1].str.split('/', expand=True)[[0,2]].rename(columns={0:'Month', 2:'Year'}), left_index=True, right_index=True)
sea_level_cleaned['Year'] = sea_level_cleaned['Year'].astype(int)
sea_level_cleaned['Month'] = sea_level_cleaned['Month'].astype(int)
sea_level_cleaned.head()

          Measure   Value  Month  Year
0     Andaman Sea  -10.34     12  1992
1     Arabian Sea  -18.46     12  1992
2  Atlantic Ocean  -15.41     12  1992
3      Baltic Sea  196.85     12  1992
4      Bay Bengal    3.27     12  1992

2. Group by `Year` and `Month`, get the mean of `Value` of the `sea_level_cleaned` table. \
    The resulting table will be stored in the `mean_sea_level_by_month` table. \

In [20]:
mean_sea_level_by_month = sea_level_cleaned.groupby(['Year', 'Month'])[['Value']].mean().reset_index().sort_values(['Year', 'Month']) 
mean_sea_level_by_month.head()

   Year  Month      Value
0  1992     12   4.265600
1  1993      1 -14.385067
2  1993      2 -31.307733
3  1993      3 -39.215733
4  1993      4 -49.520400

3. Group by `Measure` and `Year`, get the mean value of `Value` of the `sea_level_cleaned` table. \
    The resulting table will be stored in the `mean_sea_level_by_sea` table.

In [21]:
mean_sea_level_by_sea = sea_level_cleaned.groupby(['Measure', 'Year'])[['Value']].mean().reset_index().sort_values(['Measure', 'Year']) 
mean_sea_level_by_sea.head()

        Measure  Year      Value
0  Adriatic Sea  1992 -21.360000
1  Adriatic Sea  1993 -47.668824
2  Adriatic Sea  1994 -23.842353
3  Adriatic Sea  1995 -19.478750
4  Adriatic Sea  1996   2.120303

### temp_change table

1. Create `temp_change_cleaned` data frame to store the cleaned data. 
2. Extract `Year` column from the original `temp_change` data frame, convert those dates to strings. 
3. Use string slicing to retrieve `Year` and `Month` from the dates in the uncleaned data frame, converts them to int, and then assign them to the corresponding `Year` and `Month` column of the cleaned `temp_change_cleaned` data frame. 
4. Sort the cleaned data in `temp_change_cleaned` by the `Year` and `Month` of the data.

In [22]:
temp_change_cleaned = temp_change.copy()
time = temp_change['Year'].astype(str)
temp_change_cleaned['Year'] = time.str[:4].astype(int)
temp_change_cleaned['Month'] = time.str[4:].astype(int)
temp_change_cleaned = temp_change_cleaned.groupby(['Year', 'Month']).mean().reset_index().sort_values(['Year', 'Month']) 
temp_change_cleaned.head()

   Year  Month  Value
0  1900      1  -0.30
1  1900      2  -0.17
2  1900      3  -0.03
3  1900      4  -0.05
4  1900      5  -0.06

### Merging data sets

1. Merge the first dataset Temp Anomalies with the second dataset Change in Mean Sea Levels on the Year / Month columns.

2. Merge this combined dataset with the third dataset Atmospheric CO2 Concentrations again on the Year / Month columns.

In [24]:
# Merge the two dataframes
mean_sea_level_by_month = mean_sea_level_by_month.rename(columns={'Value': 'Sea_Level'})
temp_change_cleaned = temp_change_cleaned.rename(columns={'Value': 'Temp_Anomaly'})
merged_df = pd.merge(mean_sea_level_by_month, temp_change_cleaned, how='inner', on=['Year', 'Month'])
merged_df.head()

   Year  Month  Sea_Level  Temp_Anomaly
0  1992     12   4.265600          0.22
1  1993      1 -14.385067          0.34
2  1993      2 -31.307733          0.39
3  1993      3 -39.215733          0.38
4  1993      4 -49.520400          0.36